Repository: miyako/HDI_Indexes
Catalog: Resources/*.lproj/4D_IndexesFR.xlf
Languages: french

# MenusDemo_IndexesDemo
source: Indexes Demo
french: Démo index

# MenusDemo_CloseWindow
source: Close Window
french: Fermer la fenêtre

# Page0_Function
source: Function
french: Fonction

# Page0_Informations
source: Information
french: Informations

# Page0_StructureAndGeneration
source: Structure and generation of data
french: Structure et génération de données

# Page0_BTreeIndexCreation
source: "B-Tree" type index - Creation
french: Index de type "B-Tree" - Creation

# Page0_BTreeIndexDemo
source: "B-Tree" type index - Demonstration
french: Index de type "B-Tree" - Démonstration

# Page0_ClusterIndexCreation
source: "Cluster" type index - Creation
french: Index de type "Cluster" - Création

# Page0_ClusterIndexDemo
source: "Cluster" type index - Demonstration
french: Index de type "Cluster" - Démonstration

# Page0_CoompositeIndexCreation
source: "Composite" type index - Creation
french: Index de type "Composite" - Création

# Page0_CoompositeIndexDemo
source: "Composite" type index - Demonstration
french: Index de type "Composite" - Démonstration

# Page0_KeywordsIndexCreation
source: "Keywords" type index - Creation
french: Index de type "Mots-clés" - Création

# Page0_KeywordsIndexDemo
source: "Keywords" type index - Demonstration
french: Index de type "Mots-clés" - Démonstration

# Page1_TextInfos
source: This database shows an example of a very simple database structure containing only two tables: Companies and Contacts. Each table includes a certain number of fields with different types that may or may not be indexed in order to optimize queries and sorts. You can randomly generate additional companies and contacts if you so desire.
french: Cette base montre un exemple de structure de base de données très simple faisant intervenir deux tables : Sociétés et contacts. Chaque table comporte un certain nombre de champs de types différents qui seront ou non indexés afin d'optimiser les recherches et les tris. Vous pouvez générer aléatoirement des sociétés et des contacts supplémentaires si vous le désirez.

# Page1_NumberOfCompanies
source: Number of companies:
french: Nombre de sociétés :

# Page1_NumberOfContacts
source: Number of contacts:
french: Nombre de contacts :

# Page1_NumberOfCompaniesToBeGenerated
source: Number of companies to be generated:
french: Nombre de sociétés à générer :

# Page1_NumberOfContactsToBeGenerated
source: Number of contacts by company (Min/Max):
french: Nombre de contacts par société (Min/Max) :

# Page1_Parameters
source: Parameters
french: Paramètres

# Page1_Generate
source: Generate
french: Générer

# Page1_Abort
source: Abort
french: Interrompre

# Page2_TextInfos
source: "B-Tree" type indexes can be used to optimize both queries and sorts. They are used preferably on fields whose contents are unique or do not repeat frequently. Examples: IDs, last names, dates of birth, etc. The fields where this is the case are identified by bullets and should thus be given a B-tree index.
french: Les index de type "B-Tree" permettent d'optimiser à la fois les recherches et les tris. Ils sont à utiliser de préférence sur des champs dont les contenus sont uniques ou à faible occurrence. Exemples : Identifiants uniques, nom de familles, dates de naissances, etc. Les champs identifiés par des puces sont dans ce cas et doivent donc bénéficier d'un index B-tree.

# Page2_Create
source: Create B-Tree indexes
french: Créer les index B-Tree

# Page2_Delete
source: Delete B-Tree indexes
french: Supprimer les index B-Tree

# Page3_TextInfos
source: This page is an example of a simple query based on the name. It is possible to query either companies or contacts. The query is of the "starts with" type; you do not have to type the full name in the query area.
french: Cette page est un exemple de recherche simple basée sur le nom. il est possible de chercher soit des sociétés, soit des contacts. La recherche est de type "commence par", vous n'avez donc pas besoin de taper le nom complet dans la zone de recherche.

# Page3_SearchCompanies
source: Search companies
french: Chercher sociétés

# Page3_SearchContacts
source: Search contacts
french: Chercher contacts

# Page3_Name
source: Name:
french: Nom :

# Page3_ShowAll
source: Show all
french: Tout montrer

# Page3_Companies
source: COMPANIES
french: SOCIÉTÉS

# Page3_PerfAndInfos1
source: Number of Companies: Number of Contacts: Duration of query: Duration of sort:
french: Nombre de Sociétés : Nombre de Contacts : Temps de recherche : temps de tri :

# Page3_PerfAndInfos2
source: <a1> out of <a2> <b1> out of <b2> <n1> <Unit1> <n2> <Unit2>
french: <a1> parmi <a2> <b1> parmi <b2> <n1> <Unit1> <n2> <Unit2>

# Page3_SearchName
source: Name
french: Nom

# Page4_TextInfos
source: "Cluster" type indexes allow you to optimize queries. They are used preferably on fields that recur regularly. Examples: IDs, last names, dates of birth, etc. This is typically the case of the "CONTACTS.CompanyID" field whose values are duplicated as many times as there are contacts for each company. The other fields identified by bullets are in the same case and can therefore also be given "Cluster" type indexes.
french: Les index de type "Cluster" permettent d'optimiser les recherches. Ils sont à utiliser de préférence sur des champs dont les occurrences reviennent régulièrement. Exemples : Identifiants uniques, nom de familles, dates de naissances, etc. C'est typiquement le cas du champ "CONTACTS.CompanyID" dont les valeurs sont répliquées autant de fois qu'il y a de contacts dans chaque société. Les autres champs identifiés par des puces sont dans le même cas et peuvent donc également bénéficier d'un index "Cluster".

# Page4_Create
source: Create Cluster indexes
french: Créer les index cluster

# Page4_Delete
source: Delete Cluster indexes
french: Supprimer les index clusters

# Page5_TextInfos
source: This page is an example of a simple query based on a relation between two tables. The contacts are linked to the companies by a company ID: this ID is unique in the Companies table (COMPANIES.ID) but is duplicated in each of the contacts (CONTACTS.CompanyID). This justifies the creation of a "Cluster" type index associated with the "CompanyID" field of the "Contacts" table. A single or multiple selection in the "Companies" table returns the list of corresponding "Contacts".
french: Cette page est un exemple de recherche simple basée sur une relation entre deux tables. Les contacts sont reliés au sociétés par un identifiant de société : cet identifiant est unique dans la table des sociétés (COMPANIES.ID) mais est répliqué dans chacun des contacts (CONTACTS.CompanyID). Cela justifie la création d'un index de type "Cluster" associé au champ "CompanyID" de la table "Contacts". Une sélection simple ou multiple dans la table "Companies" renvoie la liste des "Contacts" correspondants.

# Page5_Select
source: Select one or more companies to find the corresponding contacts
french: Sélectionnez une ou plusieurs compagnies pour retrouver les contacts correspondants…

# Page5_Animate
source: Animate
french: Animer

# Page5_HorizontalContatenation
source: Horizontal concatenation
french: Concaténation horizontale

# Page5_VerticalContatenation
source: Vertical concatenation
french: Concaténation verticale

# Page5_Superimposition
source: Superimposition
french: Superposition

# Page6_TextInfos
source: In certain cases, it may be useful to group together two or more fields within a single index. This type of index is particularly effective when sorting tables on multiple criteria. Examples: last name + first name, state + city, etc.
french: Dans certains cas, il peut être utile de regrouper deux champs ou d'avantage au sein d'un index unique. Ce type d'index est particulièrement efficace lorsqu'il s'agit de trier des tables sur des critères multiples. Exemples : Nom+Prénom, Province+Ville, etc.

# Page6_Create
source: Create composite indexes
french: Créer les index composites

# Page6_Delete
source: Delete composite indexes
french: Supprimer les index composites

# Page7_TextInfos
source: Composite indexes created on the "State+City" fields of the "Companies" table as well as on the "Last name + First name" fields of the "Contacts" table can be used to accelerate sorting. Thanks to these indexes, you will notice that sorting both these tables takes the same amount of time regardless of whether we use one or two sort criteria!
french: Les index composites créés sur les champs "Province+Ville" de la table "Sociétés" ainsi que sur les champs "Nom+Prénom" de la table "Contacts" permettent d'accélérer les tris. Grâce à la présence de ces index, vous pourrez constater que le tri de ces deux tables prend le même temps que l'on utilise un seul ou deux critères de tri !

# Page7_OrderByCity
source: Order by city
french: Trier par ville

# Page7_OrderByStateCity
source: Order by state + city
french: Trier par province+ville

# Page7_OrderByName
source: Order by last name
french: Trier par nom

# Page7_OrderByNamefirstname
source: Order by last name+ first name
french: Trier par nom+prénom

# Page8_TextInfos
source: Indexes to be used on Text type fields will be of the "Keywords" type and will allow rapid queries based on whole words or of the "starts with" type. Example: a record contains the word "computer". It will be found… - If the search criteria is "computer" but not if the word "puter" is searched for. - If the search criteria is "starts with" "Comp". N.B.: This query is not diacritical (no accented characters) nor case sensitive (upper/lower case).
french: Les index à utiliser pour les champs de type texte seront de type "Mots-clés" et permettront d'effectuer rapidement des recherches par mots complets ou "commençant par…" Exemple : un enregistrement contient le mot "ordinateur". Il sera trouvé… - Si le critère de recherche est "ordinateur" mais ne le sera pas si le mot cherché est "dinat". - Si le critère de recherche est "commence par" "Ordin". N.B. : Cette recherche n'est ni diacritique (caractères accentués) ni sensible à la casse (majuscules/minuscules).

# Page8_Create
source: Create Keywords index
french: Créer l'index mots-clés

# Page8_Delete
source: Delete Keywords index
french: Supprimer l'index mots-clés

# Page9_TextInfos
source: The comments contained in the "Companies" table have been generated randomly from various texts whose sentences have been mixed together. You can thus search for common words like "house", "water", "sun" and you will probably find several records! When you select the records found, you will see the comments appear with the word searched for highlighted.
french: Les commentaires contenus dans la table "Compagnies" ont été générés aléatoirement à partir de divers textes dont les phrases ont été mélangées. Vous pouvez donc chercher des mots courants comme "maison", "eau", soleil" et vous trouverez probablement des enregistrements ! En Sélectionnant les enregistrements trouvés, vous verrez apparaitre les commentaires avec le mot cherché surligné.

# Page9_Reset
source: Reset
french: Réinitialiser

# Page9_GreyScale
source: Gray scale
french: Niveaux de gris

# Page9_Keyword
source: Keyword
french: Mot-Clé

# Page9_ExactWord
source: Exactly matches:
french: Est exactement :

# Page9_StartingWith
source: Starts with:
french: Commence par :
